micro-benches/2-level/patches/amg2013/mutations/p2p.count-mismatch.01/amg.par_csr.one-off.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index 813ee5d..349f203 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -82,7 +82,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
    	{
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
-      		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
+      		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start+1;
       		MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
 			ip, 0, comm, &requests[j++]);
    	}
