micro-benches/2-level/patches/kripke/mutations/coll.type-mismatch.01/kripke.Comm.h.mpi_int.patch
diff --git a/src/Kripke/Core/Comm.h b/src/Kripke/Core/Comm.h
index 0efcd76..4c3cafe 100644
--- a/src/Kripke/Core/Comm.h
+++ b/src/Kripke/Core/Comm.h
@@ -121,7 +121,7 @@ class Comm : public Kripke::Core::BaseVar {
     RAJA_INLINE
     long allReduceSumLong(long value) const {
 #ifdef KRIPKE_USE_MPI
-      MPI_Allreduce(MPI_IN_PLACE, &value, 1, MPI_LONG, MPI_SUM, m_comm);
+      MPI_Allreduce(MPI_IN_PLACE, &value, 1, MPI_INT, MPI_SUM, m_comm);
 #endif
       return value;
     }
