micro-benches/2-level/patches/kripke/mutations/p2p.illegal-rank.01/kripke.ParallelComm.cpp.illegal-rank.patch
diff --git a/src/Kripke/ParallelComm.cpp b/src/Kripke/ParallelComm.cpp
index 25d6c9c..b699852 100644
--- a/src/Kripke/ParallelComm.cpp
+++ b/src/Kripke/ParallelComm.cpp
@@ -173,7 +173,7 @@ void ParallelComm::postSends(Kripke::Core::DataStore &data_store, Kripke::SdomId
     size_t plane_data_size = plane_data.size(sdom_id);
 
     // Post the send
-    MPI_Isend(src_buffers[*dim], plane_data_size, MPI_DOUBLE, downwind_rank,
+    MPI_Isend(src_buffers[*dim], plane_data_size, MPI_DOUBLE, *downwind_sdom,
       *downwind_sdom, MPI_COMM_WORLD, &send_requests[send_requests.size()-1]);
 
 #else
